In [19]:
# Import the pandas library
import pandas as pd

In [70]:
import numpy as np

df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'b', 'c', 'd'], columns=['x', 'y', 'z'])

In [71]:
df

          x         y         z
a -0.846388 -0.903458 -1.057265
b -1.183264 -0.129356  0.992972
c -1.018150  0.144546  0.739687
d  0.765114 -0.453814 -0.819845

In [42]:
type(df['x'])

pandas.core.series.Series

In [43]:
type(df)

pandas.core.frame.DataFrame

In [72]:
df['x']

a   -0.846388
b   -1.183264
c   -1.018150
d    0.765114
Name: x, dtype: float64

In [88]:
df[['x', 'y']]

          x         y
a -0.846388 -0.903458
b -1.183264 -0.129356
c -1.018150  0.144546
d  0.765114 -0.453814

In [89]:
df['w'] = np.random.randn(4)

In [90]:
df

          x         y         z         w
a -0.846388 -0.903458 -1.057265  0.636073
b -1.183264 -0.129356  0.992972  0.138974
c -1.018150  0.144546  0.739687 -0.747489
d  0.765114 -0.453814 -0.819845 -1.058778

In [91]:
df.drop('w', axis=1) # not in place

          x         y         z
a -0.846388 -0.903458 -1.057265
b -1.183264 -0.129356  0.992972
c -1.018150  0.144546  0.739687
d  0.765114 -0.453814 -0.819845

In [92]:
df

          x         y         z         w
a -0.846388 -0.903458 -1.057265  0.636073
b -1.183264 -0.129356  0.992972  0.138974
c -1.018150  0.144546  0.739687 -0.747489
d  0.765114 -0.453814 -0.819845 -1.058778

In [93]:
df.drop('w', axis=1, inplace=True) # in place

In [94]:
df

          x         y         z
a -0.846388 -0.903458 -1.057265
b -1.183264 -0.129356  0.992972
c -1.018150  0.144546  0.739687
d  0.765114 -0.453814 -0.819845

In [52]:
df.drop('d', axis=0)

          x         y         z
a -0.339885 -1.120729  2.334122
b -0.449745  1.903561  1.582607
c  0.790738  0.012708  1.076804

In [97]:
df

          x         y         z
a -0.846388 -0.903458 -1.057265
b -1.183264 -0.129356  0.992972
c -1.018150  0.144546  0.739687
d  0.765114 -0.453814 -0.819845

In [98]:
df.shape # where does axis come from?

(4, 3)

In [99]:
df.loc['a'] # access row using index name

x   -0.846388
y   -0.903458
z   -1.057265
Name: a, dtype: float64

In [100]:
df.iloc[0] # access row using index

x   -0.846388
y   -0.903458
z   -1.057265
Name: a, dtype: float64

In [101]:
df.loc['a', 'x'] # access one record using index name and column name

-0.8463880394369955

In [59]:
df.loc[['a', 'b'], ['x', 'y']] # access multiple matrix using index names and column names

          x         y
a -0.339885 -1.120729
b -0.449745  1.903561

In [106]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'b', 'c', 'd'], columns=['x', 'y', 'z'])
print(df)
df > 1

          x         y         z
a  0.215950  0.065534 -0.379301
b  0.737642 -1.139001 -0.532242
c -2.915280 -0.769319  1.507322
d  1.784532 -0.068747 -1.003914

       x      y      z
a  False  False  False
b  False  False  False
c  False  False   True
d   True  False  False

In [107]:
df[df > 1]

          x   y         z
a       NaN NaN       NaN
b       NaN NaN       NaN
c       NaN NaN  1.507322
d  1.784532 NaN       NaN

In [111]:
df['x'] > 0

a     True
b     True
c    False
d     True
Name: x, dtype: bool

In [112]:
df[df['x'] > 0]

          x         y         z
a  0.215950  0.065534 -0.379301
b  0.737642 -1.139001 -0.532242
d  1.784532 -0.068747 -1.003914

In [113]:
df[df['x'] > 0]['y']

a    0.065534
b   -1.139001
d   -0.068747
Name: y, dtype: float64

In [114]:
df

          x         y         z
a  0.215950  0.065534 -0.379301
b  0.737642 -1.139001 -0.532242
c -2.915280 -0.769319  1.507322
d  1.784532 -0.068747 -1.003914

In [116]:
df[(df['x'] > 0) | (df['y'] > 0)] # make sure you are using & or | since those are series

          x         y         z
a  0.215950  0.065534 -0.379301
b  0.737642 -1.139001 -0.532242
d  1.784532 -0.068747 -1.003914

In [117]:
# Create a dictionary of data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}

# Create a pandas DataFrame from the dictionary
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [118]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [119]:
df.loc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [120]:
# filtering
df[df['Age'] > 30]

      Name  Age         City
2  Charlie   35  Los Angeles
3    David   40      Chicago

In [12]:
# adding new column
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}

df = pd.DataFrame(data)

# Add a new column 'City'
df['City'] = ['New York', 'San Francisco', 'Los Angeles']
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [121]:
# deleting a column
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}

df = pd.DataFrame(data)

# Delete the 'City' column
df.drop('City', axis=1, inplace=True)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35